Repository: Bengerthelorf/macIconChanger
Catalog: IconChanger/*.lproj/Localizable.strings
Languages: fr, ja

source: %lld cached icons ready for restoration
fr: %lld icônes en cache prêtes à être restaurées
ja: %lld 個のキャッシュされたアイコンを復元準備完了

source: 1. A dialog will appear requesting access to /Applications
fr: 1. Une boîte de dialogue demandant l'accès à /Applications apparaîtra
ja: 1. /Applicationsへのアクセスを要求するダイアログが表示されます

source: 1. Open the System Setting App
fr: 1. Ouvrez les Réglages Système
ja: 1. 「システム設定」を開きます

source: 2. Go to the security
fr: 2. Allez à Confidentialité et Sécurité
ja: 2. 「プライバシーとセキュリティ」に移動します

source: 2. Please choose /Applications and click OK
fr: 2. Veuillez choisir /Applications et cliquer sur OK
ja: 2. /Applicationsを選択し、「OK」をクリックしてください

source: 3. Choose the Full Disk Access
fr: 3. Choisissez Accès complet au disque
ja: 3. 「フルディスクアクセス」を選択します

source: 4. Unlock it
fr: 4. Déverrouillez-le
ja: 4. ロックを解除します

source: 5. Choose or add the IconChanger
fr: 5. Choisissez ou ajoutez IconChanger
ja: 5. IconChangerを選択または追加します

source: 6. Check the check box
fr: 6. Cochez la case
ja: 6. チェックボックスをオンにします

source: API Key:
fr: Clé API :
ja: APIキー:

source: API connection established but no results returned.
fr: Connexion API établie mais aucun résultat retourné.
ja: API接続は確立されましたが、結果は返されませんでした。

source: API connection successful!
fr: Connexion API réussie !
ja: API接続に成功しました！

source: API connection successful! Found %@ icons.
fr: Connexion API réussie ! %@ icônes trouvées.
ja: API接続成功！%@ 個のアイコンが見つかりました。

source: API test failed: %@
fr: Test API échoué : %@
ja: APIテストに失敗しました: %@

source: About Configuration Files
fr: À propos des fichiers de configuration
ja: 構成ファイルについて

source: After importing with CLI, restart the app to see the changes take effect.
fr: Après l'importation avec CLI, redémarrez l'application pour que les modifications prennent effet.
ja: CLIでインポートした後、変更を有効にするにはアプリを再起動してください。

source: Alias Name
fr: Nom d'alias
ja: エイリアス名

source: Alias Names
fr: Noms d'alias
ja: エイリアス名

source: App Name
fr: Nom de l'application
ja: アプリ名

source: App Visibility
fr: Visibilité de l'application
ja: アプリの可視性

source: Application
ja: アプリケーション

source: Application Folders
fr: Dossiers d'application
ja: アプリケーションフォルダ

source: Automatic Icon Restoration
fr: Restauration automatique des icônes
ja: アイコンの自動復元

source: Background
fr: Tâche de fond
ja: バックグラウンド

source: Background Service
fr: Service en tâche de fond
ja: バックグラウンドサービス

source: Background service is running
fr: Le service en tâche de fond est en cours d'exécution
ja: バックグラウンドサービスが実行中です

source: CLI Tool is installed
fr: L'outil CLI est installé
ja: CLIツールはインストールされています

source: CLI Tool is not installed
fr: L'outil CLI n'est pas installé
ja: CLIツールはインストールされていません

source: Cancel
fr: Annuler
ja: キャンセル

source: Changes will take full effect after restarting the app
fr: Les changements prendront pleinement effet après le redémarrage de l'application
ja: 変更はアプリを再起動した後に完全に有効になります

source: Changing the icon...
fr: Modification de l'icône en cours...
ja: アイコンを変更中...

source: Check Interval:
fr: Intervalle de vérification :
ja: チェック間隔:

source: Check for Updates…
fr: Rechercher les mises à jour…
ja: アップデートを確認…

source: Check the Access Permition
fr: Vérifier si l'accès complet est activé
ja: アクセス権限を確認

source: Simplified Chinese
fr: Chinois simplifié
ja: 簡体字中国語

source: Traditional Chinese
fr: Chinois traditionnel
ja: 繁体字中国語

source: Japanese
fr: Japonais
ja: 日本語

source: Choose from the Local
fr: Choisir depuis le Finder
ja: ローカルから選択

source: Clear Cache
fr: Vider le cache
ja: キャッシュをクリア

source: Command Line
fr: Ligne de commande
ja: コマンドライン

source: Command Line Tool
fr: Outil en ligne de commande
ja: コマンドラインツール

source: Configuration
ja: 構成

source: Copy
fr: Copier
ja: コピー

source: Copy the Name
fr: Copier le nom
ja: 名前をコピー

source: Copy the Path Name
fr: Copier le Chemin d'accès
ja: パス名をコピー

source: Current Configuration
fr: Configuration actuelle
ja: 現在の構成

source: Custom Check Interval:
fr: Intervalle de vérification personnalisé :
ja: カスタムチェック間隔:

source: Custom Interval:
fr: Intervalle personnalisé :
ja: カスタム間隔:

source: Custom icons have been successfully restored.
fr: Les icônes personnalisées ont été restaurées avec succès.
ja: カスタムアイコンは正常に復元されました。

source: English
fr: Anglais
ja: 英語

source: Enter a custom interval (in hours) for automatic icon restoration.
fr: Entrez un intervalle personnalisé (en heures) pour la restauration automatique des icônes.
ja: アイコン自動復元のためのカスタム間隔（時間単位）を入力してください。

source: Enter a custom interval (in minutes) for checking app updates.
fr: Entrez un intervalle personnalisé (en minutes) pour la vérification des mises à jour d'applications.
ja: アプリ更新チェックのためのカスタム間隔（分単位）を入力してください。

source: Error
fr: Erreur
ja: エラー

source: Error: %@
fr: Erreur : %@
ja: エラー: %@

source: Export Configuration
fr: Exporter la configuration
ja: 構成をエクスポート

source: Export a configuration:
fr: Exporter une configuration :
ja: 構成をエクスポート:

source: Finish
fr: Terminer
ja: 完了

source: Folder
fr: Dossier
ja: フォルダ

source: French
fr: Français
ja: フランス語

source: Hours
fr: Heures
ja: 時間

source: Icon Cache
fr: Cache d'icônes
ja: アイコンキャッシュ

source: Icons Restored
fr: Icônes restaurées
ja: アイコン復元済み

source: Icons will be cached automatically when you apply them to apps
fr: Les icônes seront mises en cache automatiquement lorsque vous les appliquerez aux applications
ja: アイコンはアプリに適用されると自動的にキャッシュされます

source: Import & Export
fr: Importer et Exporter
ja: インポートとエクスポート

source: Import Configuration
fr: Importer la configuration
ja: 構成をインポート

source: Import a configuration:
fr: Importer une configuration :
ja: 構成をインポート:

source: Important Note:
fr: Note importante :
ja: 重要な注意:

source: Install CLI Tool
fr: Installer l'outil CLI
ja: CLIツールをインストール

source: Install Helper Again
fr: Réinstaller l'assistant
ja: ヘルパーを再インストール

source: Installation Path:
fr: Chemin d'installation :
ja: インストールパス:

source: Interval:
fr: Intervalle :
ja: 間隔:

source: Language
fr: Langue
ja: 言語

source: Language Changed
fr: Langue modifiée
ja: 言語が変更されました

source: Last Check:
fr: Dernière vérification :
ja: 最終チェック:

source: Last Restore:
fr: Dernière restauration :
ja: 最終復元:

source: Loading
fr: Chargement
ja: 読み込み中

source: Local
ja: ローカル

source: Minutes
ja: 分

source: Next restore: %@
fr: Prochaine restauration : %@
ja: 次の復元: %@

source: No Icon
fr: Pas d'icône
ja: アイコンなし

source: No Icons Found
fr: Aucune icône trouvée
ja: アイコンが見つかりません

source: No cached icons found
fr: Aucune icône mise en cache trouvée
ja: キャッシュされたアイコンが見つかりません

source: Path
fr: Chemin
ja: パス

source: Query Host:
fr: Hôte de requête :
ja: クエリホスト:

source: Remove from Cache
fr: Retirer du cache
ja: キャッシュから削除

source: Remove the Icon from the Launchpad
fr: Supprimer du Launchpad
ja: Launchpadからアイコンを削除

source: Request Access
fr: Demander l'accès
ja: アクセスを要求

source: Restore All
fr: Tout restaurer
ja: すべて復元

source: Restore All Cached Icons
fr: Restaurer toutes les icônes en cache
ja: キャッシュされたすべてのアイコンを復元

source: Restore Cached Icons
fr: Restaurer les icônes en cache
ja: キャッシュされたアイコンを復元

source: Restore Icons When Apps Update
fr: Restaurer les icônes lors de la mise à jour des applications
ja: アプリ更新時にアイコンを復元

source: Restore Icons on Schedule
fr: Restaurer les icônes selon le planning
ja: スケジュールでアイコンを復元

source: Restore Selected
fr: Restaurer la sélection
ja: 選択項目を復元

source: Restore This Icon
fr: Restaurer cette icône
ja: このアイコンを復元

source: Restoring icons...
fr: Restauration des icônes en cours...
ja: アイコンを復元中...

source: Run in Background
fr: Exécuter en tâche de fond
ja: バックグラウンドで実行

source: Save
fr: Enregistrer
ja: 保存

source: Select an app to see its details
fr: Sélectionnez une application pour voir ses détails
ja: アプリを選択して詳細を表示

source: Set Alias Name
fr: Définir un alias
ja: エイリアス名を設定

source: Set Custom Check Interval
fr: Définir l'intervalle de vérification personnalisé
ja: カスタムチェック間隔を設定

source: Set Custom Restoration Interval
fr: Définir l'intervalle de restauration personnalisé
ja: カスタム復元間隔を設定

source: Set the Alias
fr: Définir l'alias
ja: エイリアスを設定

source: Show More
fr: Afficher plus
ja: さらに表示

source: Show in Dock
fr: Afficher dans le Dock
ja: Dockに表示

source: Show in Menu Bar
fr: Afficher dans la barre des menus
ja: メニューバーに表示

source: Show in the Finder
fr: Afficher dans le Finder
ja: Finderで表示

source: System Default
fr: Par défaut
ja: システムデフォルト

source: Test API Connection
fr: Tester la connexion API
ja: API接続をテスト

source: Testing...
fr: Test en cours...
ja: テスト中...

source: The IconChanger CLI tool provides command-line access to import and export configurations.
fr: L'outil CLI IconChanger fournit un accès en ligne de commande pour importer et exporter les configurations.
ja: IconChanger CLIツールは、構成をインポートおよびエクスポートするためのコマンドラインアクセスを提供します。

source: The app will monitor your cached applications for updates and automatically restore their custom icons when updates are detected.
fr: L'application surveillera les mises à jour de vos applications en cache et restaurera automatiquement leurs icônes personnalisées lorsque des mises à jour seront détectées.
ja: アプリはキャッシュされたアプリケーションの更新を監視し、更新が検出されるとカスタムアイコンを自動的に復元します。

source: The language has been changed. For the best experience, please restart the application.
fr: La langue a été modifiée. Pour une meilleure expérience, veuillez redémarrer l'application.
ja: 言語が変更されました。最適な体験のために、アプリケーションを再起動してください。

source: Try different search keywords
fr: Essayez différents mots-clés de recherche
ja: 別の検索キーワードをお試しください

source: Uninstall CLI Tool
fr: Désinstaller l'outil CLI
ja: CLIツールをアンインストール

source: Unknown
fr: Inconnu
ja: 不明

source: Usage Information
fr: Informations d'utilisation
ja: 使用情報

source: We Need Access to /Applications
fr: Nous avons besoin de l'accès à /Applications
ja: /Applicationsへのアクセスが必要です

source: We Need Full Disk Access
fr: IconChanger a besoin d'un accès complet au disque
ja: フルディスクアクセスが必要です

source: You can modify the alias name for better results
fr: Vous pouvez modifier l'alias pour de meilleurs résultats
ja: より良い結果を得るためにエイリアス名を変更できます

source: You must first export a configuration from the app before using the CLI export command.
fr: Vous devez d'abord exporter une configuration depuis l'application avant d'utiliser la commande d'exportation CLI.
ja: CLIエクスポートコマンドを使用する前に、まずアプリから構成をエクスポートする必要があります。

source: You need to obtain an API key from macosicons.com
fr: Vous devez obtenir une clé API depuis macosicons.com
ja: macosicons.comからAPIキーを取得する必要があります

source: hours
fr: heures
ja: 時間

source: minutes
ja: 分

# sudoers_instructions_format
source: IconChanger needs permission to change icons using its helper script. Please grant this permission by editing the sudoers file carefully: 1. Open Terminal (in /Applications/Utilities). 2. Type `sudo visudo` and press Enter. Enter your administrator password when prompted. 3. Navigate to the end of the file using arrow keys. Press 'i' to enter INSERT mode. 4. Add ONE of the following lines EXACTLY as shown (using your username is generally preferred): ALL ALL=(ALL) NOPASSWD: %@ (Note: This grants permission to all users. While less specific, it seems necessary for reliable operation in some environments.) 5. Press 'Esc' to exit INSERT mode. 6. Type `:wq` and press Enter to save and quit. (Use `:q!` to quit without saving if you make a mistake). 7. Restart IconChanger after saving the file. WARNING: Incorrectly editing sudoers can damage your system. Proceed with caution.
fr: IconChanger a besoin de permissions pour modifier les icônes à l'aide de son script d'aide. Veuillez accorder cette permission en modifiant soigneusement le fichier sudoers : 1. Ouvrez le Terminal (dans /Applications/Utilitaires). 2. Tapez `sudo visudo` et appuyez sur Entrée. Entrez votre mot de passe administrateur lorsque vous y êtes invité. 3. Naviguez jusqu'à la fin du fichier à l'aide des touches fléchées. Appuyez sur 'i' pour passer en mode INSERTION. 4. Ajoutez EXACTEMENT l'une des lignes suivantes comme indiqué (utiliser la ligne avec votre nom d'utilisateur est généralement préférable, mais celle-ci est fournie pour fonctionner) : ALL ALL=(ALL) NOPASSWD: %@ (Note : Ceci accorde la permission à tous les utilisateurs. Bien que moins spécifique, cela semble nécessaire pour un fonctionnement fiable dans certains environnements.) 5. Appuyez sur 'Esc' pour quitter le mode INSERTION. 6. Tapez `:wq` et appuyez sur Entrée pour enregistrer et quitter. (Utilisez `:q!` pour quitter sans enregistrer si vous faites une erreur). 7. Redémarrez IconChanger après avoir enregistré le fichier. AVERTISSEMENT : Une modification incorrecte du fichier sudoers peut endommager votre système. Procédez avec prudence.
ja: IconChangerがヘルパースクリプトを使用してアイコンを変更するには権限が必要です。sudoersファイルを慎重に編集して、この権限を付与してください： 1. ターミナルを開きます（/アプリケーション/ユーティリティ内）。 2. `sudo visudo` と入力し、Enterキーを押します。プロンプトが表示されたら管理者パスワードを入力します。 3. 矢印キーでファイルの末尾に移動します。「i」キーを押して挿入モードに入ります。 4. 次の行のいずれかを（通常はユーザー名を使用する方が望ましいですが）表示されている通りに正確に追加します： ALL ALL=(ALL) NOPASSWD: %@ (注意：これはすべてのユーザーに権限を付与します。具体的ではありませんが、一部の環境で確実に動作させるためには必要と思われる場合があります。) 5. Escキーを押して挿入モードを終了します。 6. `:wq` と入力し、Enterキーを押して保存し終了します。（間違えた場合は `:q!` と入力し、Enterキーを押して保存せずに終了します）。 7. ファイルを保存した後、IconChangerを再起動します。 警告：sudoersファイルを誤って編集すると、システムに損害を与える可能性があります。注意して進めてください。

# helper_files_missing_instructions_format
source: The following helper files required by IconChanger seem to be missing or couldn't be copied: %@ Expected location: %@ Please try the following: 1. Ensure IconChanger has write permissions for the `~/.iconchanger` directory. 2. Restart IconChanger. 3. If the problem persists, try reinstalling the application.
fr: Les fichiers d'aide suivants requis par IconChanger semblent manquants ou n'ont pas pu être copiés : %@ Emplacement attendu : %@ Veuillez essayer ce qui suit : 1. Assurez-vous qu'IconChanger dispose des autorisations d'écriture pour le répertoire `~/.iconchanger`. 2. Redémarrez IconChanger. 3. Si le problème persiste, essayez de réinstaller l'application.
ja: IconChangerに必要な以下のヘルパーファイルが見つからないか、コピーできなかったようです： %@ 予期される場所：%@ 以下をお試しください： 1. IconChangerが `~/.iconchanger` ディレクトリへの書き込み権限を持っていることを確認します。 2. IconChangerを再起動します。 3. 問題が解決しない場合は、アプリケーションを再インストールしてみてください。

# unexpected_setup_issue_format
source: An unexpected setup issue occurred (%@). Please ensure helper files exist at %@ and sudoers permissions are correct. Restarting the app might help.
fr: Un problème de configuration inattendu est survenu (%@). Veuillez vous assurer que les fichiers d'aide existent dans %@ et que les permissions sudoers sont correctes. Redémarrer l'application pourrait aider.
ja: 予期しないセットアップの問題が発生しました (%@)。ヘルパーファイルが %@ に存在し、sudoersの権限が正しいことを確認してください。アプリを再起動すると解決する場合があります。

# helper_files_missing_message_format
source: The following required helper files could not be found or copied: %@ Please ensure the app has permissions to write to its support directory (~/.iconchanger) and try restarting the application.
fr: Les fichiers d'aide requis suivants n'ont pas pu être trouvés ou copiés : %@ Veuillez vous assurer que l'application dispose des autorisations d'écriture pour son répertoire de support (~/.iconchanger) et essayez de redémarrer l'application.
ja: 以下の必要なヘルパーファイルが見つからないか、コピーできませんでした： %@ アプリケーションがそのサポートディレクトリ（~/.iconchanger）への書き込み権限を持っていることを確認し、アプリケーションを再起動してみてください。

source: Checking Setup...
fr: Vérification de la configuration...
ja: セットアップを確認中...

source: 3. If no dialog appears, you might need to grant access manually in System Settings > Privacy & Security > Files and Folders
fr: 3. Si aucune boîte de dialogue n'apparaît, vous devrez peut-être accorder l'accès manuellement dans Réglages Système > Confidentialité et sécurité > Fichiers et dossiers
ja: 3. ダイアログが表示されない場合は、「システム設定」>「プライバシーとセキュリティ」>「ファイルとフォルダ」で手動でアクセスを許可する必要がある場合があります

source: Request / Check Access
fr: Demander / Vérifier l'accès
ja: アクセスをリクエスト / 確認

source: Retry Setup Check
fr: Réessayer la vérification de la configuration
ja: セットアップ確認を再試行

source: Manual Setup Required
fr: Configuration manuelle requise
ja: 手動セットアップが必要

source: IconChanger needs permission to run its helper script with administrator privileges to change icons. This requires a manual configuration
fr: IconChanger a besoin de la permission pour exécuter son script d'aide avec les privilèges administrateur afin de modifier les icônes. Cela nécessite une configuration manuelle
ja: IconChangerがヘルパースクリプトを管理者権限で実行してアイコンを変更するには権限が必要です。 これには手動での設定が必要です

source: Show Setup Instructions
fr: Afficher les instructions de configuration
ja: セットアップ手順を表示

source: Setup Error
fr: Erreur de configuration
ja: セットアップエラー

source: Check Setup Status
fr: Vérifier l'état de la configuration
ja: セットアップ状況を確認

source: Manual setup check requested.
fr: Vérification manuelle de la configuration demandée.
ja: 手動セットアップ確認がリクエストされました。
